In [2]:
import mysql.connector

In [4]:

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="password",
    database= "company"
)

In [5]:
conn

In [103]:
pip install sqlalchemy
conda install -c anaconda sqlalchemy
import sqlalchemy
print(sqlalchemy.__version__)

SyntaxError: invalid syntax (3346800374.py, line 1)

In [18]:
query1 = "SELECT * FROM company.products"

In [53]:
products=pd.read_sql(query1,conn)
products

C:\Users\ACER\AppData\Local\Temp\ipykernel_2596\3635217702.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  products=pd.read_sql(query1,conn)

    product_id   product_name     category  price
0          101         Laptop  Electronics  250.0
1          102     Smartphone  Electronics  300.0
2          103         Tablet  Electronics  240.0
3          104     Headphones  Electronics  100.0
4          105   Office Chair    Furniture  400.0
5          106           Desk    Furniture  350.0
6          107      Bookshelf    Furniture  200.0
7          108   Dining Table    Furniture  600.0
8          109        T-shirt     Clothing   20.0
9          110          Jeans     Clothing   50.0
10         111         Jacket     Clothing   80.0
11         112          Shoes     Clothing  100.0
12         113       Football       Sports   25.0
13         114  Tennis Racket       Sports  150.0
14         115     Basketball       Sports   30.0
15         116        Gym Bag       Sports   50.0
16         117      Gym Shoes       Sports   50.0
17         118     Laptop Bag       Sports   50.0

In [20]:
query2 = "SELECT * FROM company.customers"

In [54]:
customers=pd.read_sql(query2,conn)
customers

C:\Users\ACER\AppData\Local\Temp\ipykernel_2596\2906196976.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  customers=pd.read_sql(query2,conn)

    customer_id   customer_name gender  age              city   join_date
0           201    Ashley Silva      F  -47   Lake Edwardfort  2021-01-19
1           202   Ethan Shannon      F   55        Jaredshire  2021-05-10
2           203   Colleen Lopez      M   31        South Eric  2023-07-18
3           204    Sarah Nguyen      F   52  South Wendyhaven  2020-01-23
4           205       Eric Ruiz      M   61        North Mark  2020-05-19
..          ...             ...    ...  ...               ...         ...
95          296  Amanda Johnson      M   47      Nicholasside  2021-04-01
96          297  Jessica Bolton      F   55       Abigailstad  2021-05-20
97          298  Amanda Elliott      M   40       West Hailey  2021-01-22
98          299     Robert Ball      M  -59        West James  2023-03-21
99          300  Stephen Harris      M   42        Sawyertown  2023-03-29

[100 rows x 6 columns]

In [22]:
query3 = "SELECT * FROM company.sales"

In [55]:
sales=pd.read_sql(query3,conn)
sales

C:\Users\ACER\AppData\Local\Temp\ipykernel_2596\3868615277.py:1: UserWarning: pandas only supports SQLAlchemy connectable (engine/connection) or database string URI or sqlite3 DBAPI2 connection. Other DBAPI2 objects are not tested. Please consider using SQLAlchemy.
  sales=pd.read_sql(query3,conn)

,sale_id,product_id,customer_id,quantity_sold,sale_amount,sale_date,region
0,1,107,273,5,1000.0,2024-09-01,South
1,2,104,212,7,700.0,2024-05-31,West
2,3,107,223,2,400.0,2024-03-19,West
3,4,103,288,1,240.0,2024-02-21,West
4,5,112,274,6,600.0,2024-05-05,West
...,...,...,...,...,...,...,...
295,296,113,292,9,225.0,2024-08-27,North
296,297,114,241,8,1200.0,2024-04-04,North
297,298,102,251,5,1500.0,2024-04-29,North
298,299,112,213,5,500.0,2024-11-06,South
299,300,101,267,5,1250.0,2024-03-13,North

In [28]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [56]:
products.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18 entries, 0 to 17
Data columns (total 4 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   product_id    18 non-null     int64
 1   product_name  18 non-null     object
 2   category      18 non-null     object
 3   price         18 non-null     float64
dtypes: float64(1), int64(1), object(2)
memory usage: 708.0+ bytes

In [57]:
customers.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 100 entries, 0 to 99
Data columns (total 6 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   customer_id    100 non-null    int64
 1   customer_name  100 non-null    object
 2   gender         100 non-null    object
 3   age            100 non-null    int64
 4   city           100 non-null    object
 5   join_date      100 non-null    object
dtypes: int64(2), object(4)
memory usage: 4.8+ KB

In [58]:
sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 300 entries, 0 to 299
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   sale_id        300 non-null    int64
 1   product_id     300 non-null    int64
 2   customer_id    300 non-null    int64
 3   quantity_sold  300 non-null    int64
 4   sale_amount    300 non-null    float64
 5   sale_date      300 non-null    object
 6   region         300 non-null    object
dtypes: float64(1), int64(4), object(2)
memory usage: 16.5+ KB

In [59]:
products.describe()

       product_id       price
count   18.000000   18.000000
mean   109.500000  169.166667
std      5.338539  160.571131
min    101.000000   20.000000
25%    105.250000   50.000000
50%    109.500000  100.000000
75%    113.750000  247.500000
max    118.000000  600.000000

In [60]:
customers.describe()

       customer_id        age
count   100.000000  100.00000
mean    250.500000   37.46000
std      29.011492   22.26898
min     201.000000  -59.00000
25%     225.750000   29.00000
50%     250.500000   40.00000
75%     275.250000   54.00000
max     300.000000   65.00000

In [61]:
sales.describe()

          sale_id  product_id  customer_id  quantity_sold  sale_amount
count  300.000000  300.000000   300.000000     300.000000   300.000000
mean   150.500000  108.206667   250.660000       5.510000   983.883333
std     86.746758    4.741190    29.355811       2.882869  1033.846684
min      1.000000  101.000000   201.000000       1.000000    25.000000
25%     75.750000  104.000000   224.750000       3.000000   236.250000
50%    150.500000  107.000000   251.000000       5.000000   600.000000
75%    225.250000  113.000000   276.250000       8.000000  1500.000000
max    300.000000  116.000000   300.000000      10.000000  6000.000000

In [62]:
customers

    customer_id   customer_name gender  age              city   join_date
0           201    Ashley Silva      F  -47   Lake Edwardfort  2021-01-19
1           202   Ethan Shannon      F   55        Jaredshire  2021-05-10
2           203   Colleen Lopez      M   31        South Eric  2023-07-18
3           204    Sarah Nguyen      F   52  South Wendyhaven  2020-01-23
4           205       Eric Ruiz      M   61        North Mark  2020-05-19
..          ...             ...    ...  ...               ...         ...
95          296  Amanda Johnson      M   47      Nicholasside  2021-04-01
96          297  Jessica Bolton      F   55       Abigailstad  2021-05-20
97          298  Amanda Elliott      M   40       West Hailey  2021-01-22
98          299     Robert Ball      M  -59        West James  2023-03-21
99          300  Stephen Harris      M   42        Sawyertown  2023-03-29

[100 rows x 6 columns]

In [85]:
# Replace negative ages with median
customers["age"] = customers["age"].apply(lambda x: None if x < 0 else x)
customers["age"].fillna(customers["age"].median(), inplace=True)
customers

C:\Users\ACER\AppData\Local\Temp\ipykernel_2596\1728971752.py:3: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  customers["age"].fillna(customers["age"].median(), inplace=True)

    customer_id   customer_name gender  age              city  join_date
0           201    Ashley Silva      F   42   Lake Edwardfort 2021-01-19
1           202   Ethan Shannon      F   55        Jaredshire 2021-05-10
2           203   Colleen Lopez      M   31        South Eric 2023-07-18
3           204    Sarah Nguyen      F   52  South Wendyhaven 2020-01-23
4           205       Eric Ruiz      M   61        North Mark 2020-05-19
..          ...             ...    ...  ...               ...        ...
95          296  Amanda Johnson      M   47      Nicholasside 2021-04-01
96          297  Jessica Bolton      F   55       Abigailstad 2021-05-20
97          298  Amanda Elliott      M   40       West Hailey 2021-01-22
98          299     Robert Ball      M   42        West James 2023-03-21
99          300  Stephen Harris      M   42        Sawyertown 2023-03-29

[100 rows x 6 columns]

In [82]:
# convert datatype
customers["age"]=customers["age"].round().astype(int)
customers

    customer_id   customer_name gender  age              city  join_date
0           201    Ashley Silva      F   42   Lake Edwardfort 2021-01-19
1           202   Ethan Shannon      F   55        Jaredshire 2021-05-10
2           203   Colleen Lopez      M   31        South Eric 2023-07-18
3           204    Sarah Nguyen      F   52  South Wendyhaven 2020-01-23
4           205       Eric Ruiz      M   61        North Mark 2020-05-19
..          ...             ...    ...  ...               ...        ...
95          296  Amanda Johnson      M   47      Nicholasside 2021-04-01
96          297  Jessica Bolton      F   55       Abigailstad 2021-05-20
97          298  Amanda Elliott      M   40       West Hailey 2021-01-22
98          299     Robert Ball      M   42        West James 2023-03-21
99          300  Stephen Harris      M   42        Sawyertown 2023-03-29

[100 rows x 6 columns]

In [81]:
# convert dates
customers["join_date"] = pd.to_datetime(customers["join_date"], errors="coerce")
customers

    customer_id   customer_name gender  age              city  join_date
0           201    Ashley Silva      F   42   Lake Edwardfort 2021-01-19
1           202   Ethan Shannon      F   55        Jaredshire 2021-05-10
2           203   Colleen Lopez      M   31        South Eric 2023-07-18
3           204    Sarah Nguyen      F   52  South Wendyhaven 2020-01-23
4           205       Eric Ruiz      M   61        North Mark 2020-05-19
..          ...             ...    ...  ...               ...        ...
95          296  Amanda Johnson      M   47      Nicholasside 2021-04-01
96          297  Jessica Bolton      F   55       Abigailstad 2021-05-20
97          298  Amanda Elliott      M   40       West Hailey 2021-01-22
98          299     Robert Ball      M   42        West James 2023-03-21
99          300  Stephen Harris      M   42        Sawyertown 2023-03-29

[100 rows x 6 columns]

In [80]:
# convert dates
sales["sale_date"] = pd.to_datetime(sales["sale_date"], errors="coerce")
sales

,sale_id,product_id,customer_id,quantity_sold,sale_amount,sale_date,region
0,1,107,273,5,1000.0,2024-09-01,South
1,2,104,212,7,700.0,2024-05-31,West
2,3,107,223,2,400.0,2024-03-19,West
3,4,103,288,1,240.0,2024-02-21,West
4,5,112,274,6,600.0,2024-05-05,West
...,...,...,...,...,...,...,...
295,296,113,292,9,225.0,2024-08-27,North
296,297,114,241,8,1200.0,2024-04-04,North
297,298,102,251,5,1500.0,2024-04-29,North
298,299,112,213,5,500.0,2024-11-06,South
299,300,101,267,5,1250.0,2024-03-13,North

In [90]:
products

    product_id   product_name     category  price
0          101         Laptop  Electronics  250.0
1          102     Smartphone  Electronics  300.0
2          103         Tablet  Electronics  240.0
3          104     Headphones  Electronics  100.0
4          105   Office Chair    Furniture  400.0
5          106           Desk    Furniture  350.0
6          107      Bookshelf    Furniture  200.0
7          108   Dining Table    Furniture  600.0
8          109        T-shirt     Clothing   20.0
9          110          Jeans     Clothing   50.0
10         111         Jacket     Clothing   80.0
11         112          Shoes     Clothing  100.0
12         113       Football       Sports   25.0
13         114  Tennis Racket       Sports  150.0
14         115     Basketball       Sports   30.0
15         116        Gym Bag       Sports   50.0
16         117      Gym Shoes       Sports   50.0
17         118     Laptop Bag       Sports   50.0

In [94]:
#Create a new column in the sales data to calculate total_sale_amount (quantity sold × unit price).

sales_merged = sales.merge(products[["product_id", "price"]], on="product_id", how="left")

# Create the new column: total_sale_amount = quantity_sold * price
sales_merged["total_sale_amount"] = sales_merged["quantity_sold"] * sales_merged["price"]
sales_merged["total_sale_amount"] = sales_merged["total_sale_amount"].round()
print(sales_merged)

     sale_id  product_id  customer_id  quantity_sold  sale_amount  sale_date  \
0          1         107          273              5       1000.0 2024-09-01
1          2         104          212              7        700.0 2024-05-31
2          3         107          223              2        400.0 2024-03-19
3          4         103          288              1        240.0 2024-02-21
4          5         112          274              6        600.0 2024-05-05
..       ...         ...          ...            ...          ...        ...
295      296         113          292              9        225.0 2024-08-27
296      297         114          241              8       1200.0 2024-04-04
297      298         102          251              5       1500.0 2024-04-29
298      299         112          213              5        500.0 2024-11-06
299      300         101          267              5       1250.0 2024-03-13

    region  price  total_sale_amount
0    South  200.0             1000.0
1     West  100.0              700.0
2     West  200.0              400.0
3     West  240.0              240.0
4     West  100.0              600.0
..     ...    ...                ...
295  North   25.0              225.0
296  North  150.0             1200.0
297  North  300.0             1500.0
298  South  100.0              500.0
299  North  250.0             1250.0

[300 rows x 9 columns]

In [73]:
# merge all tables
merged_df = sales.merge(customers, on="customer_id", how="left").merge(products, on="product_id", how="left")
merged_df

,sale_id,product_id,customer_id,quantity_sold,sale_amount,sale_date,region,customer_name,gender,age,city,join_date,product_name,category,price
0,1,107,273,5,1000.0,2024-09-01,South,Brian Barnes,M,62,New Ethan,2023-12-13,Bookshelf,Furniture,200.0
1,2,104,212,7,700.0,2024-05-31,West,Miss Sara White,F,40,Lake Nicholasshire,2021-09-21,Headphones,Electronics,100.0
2,3,107,223,2,400.0,2024-03-19,West,Tara Mcdowell,M,42,Kathrynfort,2022-03-17,Bookshelf,Furniture,200.0
3,4,103,288,1,240.0,2024-02-21,West,Theresa Moore,F,59,Jenniferburgh,2024-06-30,Tablet,Electronics,240.0
4,5,112,274,6,600.0,2024-05-05,West,Sharon Ortiz,F,58,South Joanna,2021-06-22,Shoes,Clothing,100.0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
295,296,113,292,9,225.0,2024-08-27,North,Zachary Miller,F,44,Robertoberg,2021-10-25,Football,Sports,25.0
296,297,114,241,8,1200.0,2024-04-04,North,Joseph Walker,M,38,Port Blakeview,2022-01-04,Tennis Racket,Sports,150.0
297,298,102,251,5,1500.0,2024-04-29,North,Darius Prince,F,29,West Kelly,2022-04-18,Smartphone,Electronics,300.0
298,299,112,213,5,500.0,2024-11-06,South,Jasmine Lowery,F,47,Port Taratown,2021-07-12,Shoes,Clothing,100.0
299,300,101,267,5,1250.0,2024-03-13,North,Alyssa Anderson,F,40,East Hannah,2021-06-02,Laptop,Electronics,250.0

In [78]:
# a) Total sales by category
sales_by_category = merged_df.groupby("category")["sale_amount"].sum().reset_index()
sales_by_category

      category  sale_amount
0     Clothing      19600.0
1  Electronics     102050.0
2    Furniture     149300.0
3       Sports      24215.0

In [79]:
# b) Average customer age by region
avg_age_region = merged_df.groupby("region")["age"].mean().reset_index()
avg_age_region

  region        age
0   East  41.295082
1  North  39.457143
2  South  41.858696
3   West  42.272727

In [89]:
print("Cleaned Data Samples:")
print(customers.head(), "\n")
print("Total Sales by Category:\n", sales_by_category)
print("Average Age by Region:\n", avg_age_region)

Cleaned Data Samples:
   customer_id  customer_name gender  age              city  join_date
0          201   Ashley Silva      F   42   Lake Edwardfort 2021-01-19
1          202  Ethan Shannon      F   55        Jaredshire 2021-05-10
2          203  Colleen Lopez      M   31        South Eric 2023-07-18
3          204   Sarah Nguyen      F   52  South Wendyhaven 2020-01-23
4          205      Eric Ruiz      M   61        North Mark 2020-05-19

Total Sales by Category:
       category  sale_amount
0     Clothing      19600.0
1  Electronics     102050.0
2    Furniture     149300.0
3       Sports      24215.0
Average Age by Region:
   region        age
0   East  41.295082
1  North  39.457143
2  South  41.858696
3   West  42.272727

In [111]:

# Converting into excel file

with pd.ExcelWriter("company_data.xlsx", engine="openpyxl") as writer:
    products.to_excel(writer, sheet_name="Products", index=False)
    customers.to_excel(writer, sheet_name="Customers", index=False)
    sales_merged.to_excel(writer, sheet_name="Sales", index=False)

print("Cleaned data saved successfully to 'company_data.xlsx'")

Cleaned data saved successfully to 'company_data.xlsx'